In [1]:
# code in chapter 7 of Data Analysis w/ Python
# data cleaning and preparation
# loading, cleaning, transforming and rearranging
# takes up 80% or more time
# tools for missing data, duplicate data, string manipulation, and some other analytical data transformations

In [40]:
# handling missing data
# in panda, using Nan (Not a number) to represent the missing value
import pandas as pd
import numpy as np

In [5]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [6]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [7]:
# filter NA
# drop na()
from numpy import nan as NA

In [8]:
data=pd.Series([1,NA,3.5,NA,7])

In [9]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [11]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],[NA, NA, NA], [NA, 6.5, 3.]])

In [12]:
cleaned=data.dropna()

In [13]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [14]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [15]:
data[4]=NA

In [16]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [17]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [18]:
# thresh for the data w/ time series characters
df = pd.DataFrame(np.random.randn(7, 3))

In [19]:
df.iloc[:4,1]=NA

In [20]:
df.iloc[:2,2]=NA

In [21]:
df

          0         1         2
0  0.497170       NaN       NaN
1  0.922283       NaN       NaN
2 -0.040645       NaN  1.287096
3 -0.237414       NaN  0.274890
4  0.402983 -0.262147  0.541133
5  0.187813 -0.679455 -0.607523
6  0.411869  1.023315  0.210809

In [22]:
df.dropna()

          0         1         2
4  0.402983 -0.262147  0.541133
5  0.187813 -0.679455 -0.607523
6  0.411869  1.023315  0.210809

In [23]:
df.dropna(thresh=2)

          0         1         2
2 -0.040645       NaN  1.287096
3 -0.237414       NaN  0.274890
4  0.402983 -0.262147  0.541133
5  0.187813 -0.679455 -0.607523
6  0.411869  1.023315  0.210809

In [24]:
# filling in missing data
# fillna is the primary function
df.fillna(0)

          0         1         2
0  0.497170  0.000000  0.000000
1  0.922283  0.000000  0.000000
2 -0.040645  0.000000  1.287096
3 -0.237414  0.000000  0.274890
4  0.402983 -0.262147  0.541133
5  0.187813 -0.679455 -0.607523
6  0.411869  1.023315  0.210809

In [25]:
df.fillna({1:0.5,2:0})

          0         1         2
0  0.497170  0.500000  0.000000
1  0.922283  0.500000  0.000000
2 -0.040645  0.500000  1.287096
3 -0.237414  0.500000  0.274890
4  0.402983 -0.262147  0.541133
5  0.187813 -0.679455 -0.607523
6  0.411869  1.023315  0.210809

In [26]:
_ = df.fillna(0, inplace=True) # fill for the current object

In [27]:
df

          0         1         2
0  0.497170  0.000000  0.000000
1  0.922283  0.000000  0.000000
2 -0.040645  0.000000  1.287096
3 -0.237414  0.000000  0.274890
4  0.402983 -0.262147  0.541133
5  0.187813 -0.679455 -0.607523
6  0.411869  1.023315  0.210809

In [28]:
# fill na for reindexing
df=pd.DataFrame(np.random.randn(6,3))

In [29]:
df.iloc[2:,1]=NA

In [30]:
df.iloc[4:,2]=NA

In [31]:
df

          0         1         2
0  0.257727  0.844089  0.417136
1  0.904455 -0.751587 -1.123498
2  0.211112       NaN -2.482981
3 -1.279843       NaN  0.060622
4  0.256072       NaN       NaN
5 -1.884592       NaN       NaN

In [32]:
df.fillna(method='ffill')

          0         1         2
0  0.257727  0.844089  0.417136
1  0.904455 -0.751587 -1.123498
2  0.211112 -0.751587 -2.482981
3 -1.279843 -0.751587  0.060622
4  0.256072 -0.751587  0.060622
5 -1.884592 -0.751587  0.060622

In [33]:
df.fillna(method='ffill',limit=2)

          0         1         2
0  0.257727  0.844089  0.417136
1  0.904455 -0.751587 -1.123498
2  0.211112 -0.751587 -2.482981
3 -1.279843 -0.751587  0.060622
4  0.256072       NaN  0.060622
5 -1.884592       NaN  0.060622

In [36]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [38]:
# fill with mean of Series
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [41]:
# data transformation
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [42]:
# return a boolean Series
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [43]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [44]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [45]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [46]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [47]:
# Transforming Data Using a Function or Mapping
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [48]:
meat_to_animal = {
    'bacon': 'pig',
    'pulled pork': 'pig',
    'pastrami': 'cow',
    'corned beef': 'cow',
    'honey ham': 'pig',
    'nova lox': 'salmon'
}

In [49]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [50]:
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [51]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [52]:
# replacing values
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [53]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [54]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [55]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [56]:
# renaming axis indexes
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [57]:
transform = lambda x: x[:4].upper()
transform

In [58]:
data.index

Index(['Ohio', 'Colorado', 'New York'], dtype='object')

In [59]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [60]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [61]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [62]:
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'pekaboo'})

         one  two  pekaboo  four
INDIANA    0    1        2     3
COLO       4    5        6     7
NEW        8    9       10    11

In [63]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

In [64]:
# Discretization and Binning
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [65]:
bins = [18, 25, 35, 60, 100]

cats = pd.cut(ages, bins)

cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [66]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [67]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]]
              closed='right',
              dtype='interval[int64]')

In [68]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [69]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [70]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [71]:
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [72]:
data = np.random.rand(20)

In [73]:
pd.cut(data, 4, precision=2)

[(0.048, 0.24], (0.048, 0.24], (0.24, 0.42], (0.61, 0.8], (0.61, 0.8], ..., (0.048, 0.24], (0.24, 0.42], (0.42, 0.61], (0.24, 0.42], (0.61, 0.8]]
Length: 20
Categories (4, interval[float64]): [(0.048, 0.24] < (0.24, 0.42] < (0.42, 0.61] < (0.61, 0.8]]

In [74]:
data = np.random.randn(1000)

In [75]:
cats = pd.qcut(data, 4) 
cats

[(0.0619, 0.639], (0.0619, 0.639], (-3.05, -0.592], (0.639, 3.5], (-0.592, 0.0619], ..., (-3.05, -0.592], (-0.592, 0.0619], (0.639, 3.5], (0.639, 3.5], (0.639, 3.5]]
Length: 1000
Categories (4, interval[float64]): [(-3.05, -0.592] < (-0.592, 0.0619] < (0.0619, 0.639] < (0.639, 3.5]]

In [76]:
pd.value_counts(cats)

(0.639, 3.5]        250
(0.0619, 0.639]     250
(-0.592, 0.0619]    250
(-3.05, -0.592]     250
dtype: int64

In [77]:
cats2 = pd.cut(data, [0, 0.1, 0.5, 0.9, 1.]) 
cats2

[(0.1, 0.5], (0.1, 0.5], NaN, NaN, NaN, ..., NaN, NaN, NaN, NaN, NaN]
Length: 1000
Categories (4, interval[float64]): [(0.0, 0.1] < (0.1, 0.5] < (0.5, 0.9] < (0.9, 1.0]]

In [78]:
pd.value_counts(cats2)

(0.1, 0.5]    193
(0.5, 0.9]    111
(0.0, 0.1]     45
(0.9, 1.0]     27
dtype: int64

In [79]:
# detecting and filtering outliers
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.023601    -0.012916    -0.016582    -0.017206
std       1.032132     1.015509     1.018346     0.941515
min      -3.422284    -4.211390    -3.069140    -2.974204
25%      -0.673898    -0.656647    -0.674395    -0.649775
50%      -0.045781     0.018980    -0.019821    -0.000406
75%       0.623946     0.681350     0.638436     0.574740
max       3.338242     3.319895     3.892432     3.033508

In [80]:
data.head()

          0         1         2         3
0  0.349420 -0.269345  0.339765 -0.726668
1  0.242467  0.738374  0.318639  0.675878
2 -0.513074  0.424012 -2.006475  1.117251
3  0.192680  0.125037  0.577040  0.951872
4 -1.073955 -0.168662 -0.277314  2.022435

In [81]:
col = data[2]
col.head()

0    0.339765
1    0.318639
2   -2.006475
3    0.577040
4   -0.277314
Name: 2, dtype: float64

In [82]:
col[np.abs(col) > 3]

362    3.892432
491   -3.069140
524   -3.006028
817    3.064757
Name: 2, dtype: float64

In [83]:
data[(np.abs(data) > 3)].head()

    0   1   2   3
0 NaN NaN NaN NaN
1 NaN NaN NaN NaN
2 NaN NaN NaN NaN
3 NaN NaN NaN NaN
4 NaN NaN NaN NaN

In [84]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
94  -0.645692  3.319895 -0.739530 -1.262430
267 -1.413879 -0.797485  2.628283  3.033508
315 -3.422284  1.841477 -1.393393  0.152126
362 -0.375530 -0.167749  3.892432 -0.262666
453  1.980040 -4.211390  1.867351  0.598780
491  0.623655 -1.339780 -3.069140 -1.271723
524  0.071169 -1.610250 -3.006028 -0.344980
645  3.223419  0.431995  2.207587 -0.621767
648  3.293519  0.804029  0.346386  0.494585
817  0.585336  0.938421  3.064757 -0.203488
910  3.338242  0.415694  0.420960  0.053647

In [85]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [86]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.024034    -0.012025    -0.017464    -0.017240
std       1.028190     1.010204     1.014885     0.941407
min      -3.000000    -3.000000    -3.000000    -2.974204
25%      -0.673898    -0.656647    -0.674395    -0.649775
50%      -0.045781     0.018980    -0.019821    -0.000406
75%       0.623946     0.681350     0.638436     0.574740
max       3.000000     3.000000     3.000000     3.000000

In [87]:
np.sign(data).head()

     0    1    2    3
0  1.0 -1.0  1.0 -1.0
1  1.0  1.0  1.0  1.0
2 -1.0  1.0 -1.0  1.0
3  1.0  1.0  1.0  1.0
4 -1.0 -1.0 -1.0  1.0

In [88]:
# permutation and random sampling
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [89]:
sampler = np.random.permutation(5)
sampler

array([2, 4, 3, 0, 1])

In [90]:
df.take(sampler)

    0   1   2   3
2   8   9  10  11
4  16  17  18  19
3  12  13  14  15
0   0   1   2   3
1   4   5   6   7

In [91]:
df.sample(n=3)

    0   1   2   3
3  12  13  14  15
4  16  17  18  19
0   0   1   2   3

In [92]:
choices = pd.Series([5, 7, -1, 6, 4])

draws = choices.sample(n=10, replace=True)

draws

3    6
4    4
0    5
2   -1
2   -1
2   -1
1    7
3    6
3    6
1    7
dtype: int64

In [93]:
# dummy variables
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1': range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [94]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [95]:
dummies = pd.get_dummies(df['key'], prefix='key')

In [96]:
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [103]:
mnames = ['movie_id', 'title', 'genres']

In [105]:
movies = pd.read_table('movies.dat', sep='::',
                       header=None, names=mnames, engine='python')
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [106]:
all_genres = []

for x in movies.genres:
    all_genres.extend(x.split('|'))
    
genres = pd.unique(all_genres)
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [107]:
zero_matrix = np.zeros((len(movies), len(genres)))

zero_matrix.shape

(3883, 18)

In [108]:
dummies = pd.DataFrame(zero_matrix, columns=genres)
dummies.head()

,Animation,Children's,Comedy,Adventure,Fantasy,Romance,Drama,Action,Crime,Thriller,Horror,Sci-Fi,Documentary,War,Musical,Mystery,Film-Noir,Western
0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [109]:
gen = movies.genres[0]
gen.split('|')

['Animation', "Children's", 'Comedy']

In [110]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2])

In [111]:
dummies.head()

,Animation,Children's,Comedy,Adventure,Fantasy,Romance,Drama,Action,Crime,Thriller,Horror,Sci-Fi,Documentary,War,Musical,Mystery,Film-Noir,Western
0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [112]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Animation                                0
Genre_Children's                               0
Genre_Comedy                                   0
Genre_Adventure                                0
Genre_Fantasy                                  0
Genre_Romance                                  0
Genre_Drama                                    0
Genre_Action                                   0
Genre_Crime                                    0
Genre_Thriller                                 0
Genre_Horror                                   0
Genre_Sci-Fi                                   0
Genre_Documentary                              0
Genre_War                                      0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Film-Noir                                0
Genre_Western                                  0
Name: 0, dtype: object

In [113]:
np.random.seed(12345)

In [114]:
values = np.random.rand(10)
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [115]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1.]

In [116]:
pd.cut(values, bins)

[(0.8, 1.0], (0.2, 0.4], (0.0, 0.2], (0.2, 0.4], (0.4, 0.6], (0.4, 0.6], (0.8, 1.0], (0.6, 0.8], (0.6, 0.8], (0.6, 0.8]]
Categories (5, interval[float64]): [(0.0, 0.2] < (0.2, 0.4] < (0.4, 0.6] < (0.6, 0.8] < (0.8, 1.0]]

In [117]:
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0